<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#merge做的是内连接('inner-join')，结果中的键为两张表的交集" data-toc-modified-id="merge做的是内连接('inner-join')，结果中的键为两张表的交集-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>merge做的是内连接('inner join')，结果中的键为两张表的交集</a></span></li><li><span><a href="#on='key'-显示指定连接键" data-toc-modified-id="on='key'-显示指定连接键-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>on='key' 显示指定连接键</a></span></li><li><span><a href="#两张表的列名不同，需要分别指定连接键-left_on-right_on" data-toc-modified-id="两张表的列名不同，需要分别指定连接键-left_on-right_on-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>两张表的列名不同，需要分别指定连接键 left_on right_on</a></span></li><li><span><a href="#默认how='inner'内连接，how='outer'外连接，how='left'左连接，how='right'右连接" data-toc-modified-id="默认how='inner'内连接，how='outer'外连接，how='left'左连接，how='right'右连接-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>默认how='inner'内连接，how='outer'外连接，how='left'左连接，how='right'右连接</a></span></li><li><span><a href="#left_index=True,-right_index-根据索引合并，即以索引为连接键" data-toc-modified-id="left_index=True,-right_index-根据索引合并，即以索引为连接键-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>left_index=True, right_index 根据索引合并，即以索引为连接键</a></span></li><li><span><a href="#join按照索引合并" data-toc-modified-id="join按照索引合并-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>join按照索引合并</a></span></li><li><span><a href="#多表连接" data-toc-modified-id="多表连接-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>多表连接</a></span></li></ul></div>

In [1]:
"""
merge()掌握以下几个参数：
1. on：用于显示指定连接键，当两张表的连接键重名时使用
2. left_on, right_on：当两张表的列名不同时，用于分别指定列名
3. how='inner'为默认，作内连接，how='outer'外连接，how='left'左连接，how='right'右连接
4. left_index=True, right_index=True 根据索引合并，即以索引为连接键
5. join(): 用于索引合并，默认为左连接
"""

"\nmerge()掌握以下几个参数：\n1. on：用于显示指定连接键，当两张表的连接键重名时使用\n2. left_on, right_on：当两张表的列名不同时，用于分别指定列名\n3. how='inner'为默认，作内连接，how='outer'外连接，how='left'左连接，how='right'右连接\n4. left_index=True, right_index=True 根据索引合并，即以索引为连接键\n5. join(): 用于索引合并，默认为左连接\n"

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})

In [4]:
df2 = DataFrame({'key': ['a', 'b', 'd'],
                 'data2': range(3)})

In [5]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [6]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

## merge做的是内连接('inner join')，结果中的键为两张表的交集

In [7]:
pd.merge(df1, df2) # 以重叠列名为连接键

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

## on='key' 显示指定连接键

In [8]:
pd.merge(df1, df2, on='key') # 显示指定连接键

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

## 两张表的列名不同，需要分别指定连接键 left_on right_on

In [9]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})

In [10]:
df4 = DataFrame({'rkey': ['a', 'b', 'd'],
                 'data2': range(3)})

In [11]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

## 默认how='inner'内连接，how='outer'外连接，how='left'左连接，how='right'右连接

In [12]:
pd.merge(df1, df2, how='outer') # how='outer': 外连接，并集

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [13]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                 'data1': range(6)})

In [14]:
df2 = DataFrame({'key': ['a', 'b', 'a', 'b' ,'d'],
                 'data2': range(5)})

In [15]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [16]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [17]:
pd.merge(df1, df2, on='key', how='left') # 以key列为连接键，左连接

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [18]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [19]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'],
                  'key2': ['one', 'two', 'one'],
                  'lval': [1, 2, 3]})

In [20]:
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                   'key2': ['one', 'one', 'one', 'two'],
                   'rval': [4, 5, 6, 7]})

In [21]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [22]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [23]:
pd.merge(left, right, on=['key1', 'key2'], how='outer') # 外连接

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [24]:
pd.merge(left, right, on='key1') # 只用key1列作为连接键

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [25]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right')) # 后缀

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

## left_index=True, right_index 根据索引合并，即以索引为连接键

In [26]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 
                   'value': range(6)})

In [27]:
right1 = DataFrame({'group_val': [3.5, 7]},
                   index=['a', 'b'])

In [28]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [29]:
right1

   group_val
a        3.5
b        7.0

In [30]:
pd.merge(left1, right1, left_on='key', right_index=True) # 左表以key列为连接键，右边以行索引为连接键

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [31]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer') # 左表以key列为连接键，右边以行索引为连接键，外连接

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [32]:
lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                   'key2': [2000, 2001, 2002, 2001, 2002],
                   'data': np.arange(5.)})

In [33]:
righth = DataFrame(np.arange(12).reshape((6, 2)),
                   index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                          [2001, 2000, 2000, 2000, 2001, 2002]], # 多层索引
                   columns=['event1', 'event2'])

In [34]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [35]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [36]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True) # 左表以key1和key2列为连接键，右表以索引为连接键

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [37]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [38]:
left2 = DataFrame([[1., 2.], [3., 4.], [5., 6.]], # 3×2
                  index=['a', 'c', 'e'],
                  columns=['Ohio', 'Nevada'])

In [39]:
right2 = DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], # 4×2
                   index=['b', 'c', 'd', 'e'],
                   columns=['Missouri', 'Alabama'])

In [40]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [41]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [42]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True) # 左右两表均已index为连接键

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

## join按照索引合并

In [43]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [45]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [46]:
right1

   group_val
a        3.5
b        7.0

In [47]:
left1.join(right1, on='key') # join默认左连接

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

## 多表连接

In [48]:
another = DataFrame([[7., 8.], [9., 10.], [11, 12.], [16., 17.]], # 4×2
                    index=['a', 'c', 'e', 'f'],
                    columns=['New York', 'Oregon'])

In [49]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [50]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [51]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [52]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [56]:
left2.join([right2, another], how='outer', sort=True) # 外连接

C:\Users\z\Anaconda3\lib\site-packages\pandas\core\frame.py:6369: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  verify_integrity=True)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [57]:
left2.join([right2, another], how='outer', sort=False)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0